app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.attributes = user_password_params
    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "role", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    unless @user == current_user
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

  def load_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]